console.log(a);

var a = 10;
// result-undefined, бо на момент підняття змінна була невідома

("======================================");
("======================================");

console.log(b);

let b = 20;
("======================================");
("======================================");

sayHello();

function sayHello() {
  console.log("Hello");
}

// Результат: Hello; функція може викликатися раніше ще до її оголошення
("======================================");
("======================================");
console.log(a);

var a = 10;

function test() {
  console.log(a);

  var a = 20;

  console.log(a);
}

test();

console.log(a);

("======================================");
("======================================");
// Hoisting — це механізм, пов'язаний зі створенням execution context, під час якого declarations стають відомими до виконання коду. var до присвоєння має значення undefined, let і const створюються, але до ініціалізації знаходяться в Temporal Dead Zone, а Function Declaration доступна повністю до місця оголошення.
