console.log(a);

var a = 10;
// result-undefined, бо на момент підняття змінна була невідома

("======================================");
("======================================");

console.log(b);

let b = 20;
("======================================");
("======================================");

sayHello();

function sayHello() {
  console.log("Hello");
}

// Результат: Hello; функція може викликатися раніше ще до її оголошення
("======================================");
("======================================");
console.log(a);

var a = 10;

function test() {
  console.log(a);

  var a = 20;

  console.log(a);
}

test();

console.log(a);
